#  1/9 2PM에 발표할 것
#  정상 작동까지!


'''
📌 📌 해결 완료
- 푸슝넣기  https://pushoong.com/ask/2224895407
- 설문조사에서 1~5번만 입력 가능하게 (점수 입력 제한)
- 아스키아트로 마무리
- 작업이 끝난 뒤 또 다시 메뉴를 볼지? 종료할지?
- 설문조사 완료 후 총평 나오게끔 (각 분야별 몇점인지 ㅇㅇ)
- 맨 처음 메뉴에서 일기 확인시 0번이면 보이지 않는다는 알림메시지 보이게끔
- 메뉴 1에서 일기 적는 부분 반복 하기 (작성 완료 후 추가 작성할건지?)
- 프로그램 이름 선제시
- 각 단계마다 시간 늦추는 거
- 일기 작성 후 날짜 작성 후 파일에 저장

📌 📌  수정 필요한거
- 저장된 일기 파일에서 호출 (아니면 사라짐!!)
- write 부분에서 추가 작성 후 종료가 되어야 하는데 또다시 입력 창이 뜬다.
- 함수들 다른 파일에 저장하고 본 파일에서는 호출시키기


📌 📌  고민중
- 반복가능한거는 반복가능하게
- 가독성 기릿
- exe 파일 생성
- 원하는 추가 기능 있으면 넣어달라고 (입력시 파일도 생성되고 그안에 내용도 저장되고 ㅇㅇ)
- 설문지 질문들 랜덤하게 할수있을까? 매번 랜덤하게 질문이 나오도록 => 파일에 미리 설문들 저장해놓고 호출
- 저장된 일기 삭제
- 파일을 닫아도 계속 감정일기 조사내용과 일기 적은 게 저장되도록 하게끔
- 감정 점수 총점 계산 후 파일에 저장

-ddfsdfasdfasd
'''



'''
프로그램 주제: 무드 트래커 및 사후 대처
있을 기능
- 환영 멘트 (미니 프로그램 이름 제시)

- 매일의 무드트래커 입력
    - 참고자료는 그런 설문조사들 ㅇㅇ
       (각 항목마다 +1점 해서 업카운트해서 일정 점수 이상이면 분류)
    - 된다면,, input 함수로 내가 왜 우울한지/ 왜 행복한지 적어볼수 있다.

- 입력된 무드를 저장해서 나중에 꺼내볼 수 있음
    - 지난 한 주 동안 내가 일정 기준 이하로 우울했던 적은 몇회인가?
    - 지난 한 주 동안 내가 일정 기준 이상으로 행복했던 적은 몇회인가?
    - 나는 행복했던/우울했던 상황은 무엇이었는가?

- 일정 점수 이하가 나오면 해결책 보여주기 (게시판, 상담전화, 리스트)
    - 이거는 오늘의 무드 입력 후 보여줄 예정
    - 비슷한 기분인 사람들 끼리 얘기하는 방 (url)
    - 상담전화 안내
    - 권장행동

- 종료시 안내 멘트
    - 예를 들면 당신은 소중합니다 이런 st
'''
