# =====================================================
# 함수 기능: 종료 메뉴 실행
# 함수 이름: print_end
# 매개 변수: 없음
# 함수 결과: 종료 멘트 print
# =====================================================

def print_end():
    print('💠종료하기💠')
    print()
    ending = '''
      ＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿          
    ／                             ＼            
       오늘 당신의 기분은 돌아보았나요?
          그럼 내일 뵙겠습니다 :)
    ＼＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿／
        　　ｏ
        　　 。
        　　　｡
        　　∧＿∧
        　 (*　･ω･)
        ＿(__つ/￣￣￣/_
        　　＼/　　　/

                '''
    print(ending)



# =====================================================
# 함수 기능: 해결책 제시하기1
# 함수 이름: happything
# 매개 변수: 없음
# 함수 결과: 데이터 print
# =====================================================

def happything():
    start = ' ================ 이런것들 해보면 어떨까요? 😇 ==================='
    one1 = '1️⃣ 같이 이야기 해요. \n  >> https://pushoong.com/ask/2224895407 << \n 위 페이지를 방문하여 같이 감정을 공유해요! '
    one2 = '익명으로 자신의 이야기를 해볼 수 있어요 :)\n'
    two1 = '2️⃣ 심호흡 해요. \n 478 호흡법 \n  - (1) 복식호흡으로 4초간 코로 숨을 들이마쉰다.\n  - (2)  ️7초간 숨을 참으며 멈춘다. '
    two2 = '  - (3)  ️8초간 숨을 내뱉는다. \n  - (4)  ️위 과정을 반복한다.\n'
    three1 = '3️⃣ 감정일기를 적는다. \n 감정일기를 쓰면 어떤 점이 좋을까? \n + 감정에 이름을 붙여보며 막연했던 감정들이 조금 더 분명해지며 해소감이 든다.'
    three2 = ' + 감정에 무작정 휩쓸리지 않고 끊어내어 감정에서 빠져나올 수 있다.\n + 부정적인 감정이 강하게 올라오는 특정 문제에 대해 알아차리고 해결책을 세울 수 있다.'

    print(start)
    print()
    print(one1)
    print(one2)
    print(two1)
    print(two2)
    print(three1)
    print(three2)
    print('\n 지금 1가지를 해볼까요? \n\n')

